cf_billing/Catalogs/энргПриборыУчетаАбонента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргПриборыУчетаАбонента</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодАСКУЭ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальноВозможныеПоказания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКанальности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыКанальности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПрибораУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТипыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрируетОбъем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипУзлаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТипыУзловУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобственникАСКУЭ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемаУчетаЭлектроэнергии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСистемыУчетаЭлектроэнергии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИнтеграцииССистемой</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобственникСИ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргБалансоваяПринадлежность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасположениеИзмерителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргРасположениеИзмерителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фаза</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргФазыТрансформатора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БалансоваяПринадлежность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргБалансоваяПринадлежность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТочкиУчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучасовыеЗначения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеВатт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеСПотерями</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентТрансформации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПонижающийКоэффициент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Измерители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Измеритель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Catalogs/энргПриборыУчетаАбонента/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура НайтиПриборыУчетаПоПараметрам(ТекущийОбъект,ИмяКоллекции, Отказ) Экспорт 
	перем ТипПрибораУчета, ВидКанальности, Код, РегистрируетОбъем, Фаза;
	
	ДанныеТабличнойЧасти 						= ТекущийОбъект[ИмяКоллекции];
			
	ОписаниеПриборов 							= Новый ТаблицаЗначений;
	ОписаниеПриборов.Колонки.Добавить("Код", 				Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(25)));
	ОписаниеПриборов.Колонки.Добавить("ТипПрибораУчета", 	Новый ОписаниеТипов("СправочникСсылка.энргТипыПриборовУчета"));
	ОписаниеПриборов.Колонки.Добавить("ВидКанальности", 	Новый ОписаниеТипов("СправочникСсылка.энргВидыКанальности"));
	ОписаниеПриборов.Колонки.Добавить("НомерСтроки", 		Новый ОписаниеТипов("Число"));
	ОписаниеПриборов.Колонки.Добавить("Индекс",		 		Новый ОписаниеТипов("Число"));
	ОписаниеПриборов.Колонки.Добавить("РегистрируетОбъем",	Новый ОписаниеТипов("Булево"));
	ОписаниеПриборов.Колонки.Добавить("Фаза"			, 	Новый ОписаниеТипов("ПеречислениеСсылка.энргФазыТрансформатора"));

	Индекс  									= 0;
	Для Каждого СтрокаТаблицы Из ДанныеТабличнойЧасти Цикл
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТаблицы,"УстановленныйПУ") И СтрокаТаблицы.УстановленныйПУ Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицы.ПриборУчета  				= Справочники.энргПриборыУчетаАбонента.ПустаяСсылка();
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.ОписаниеПрибора) Тогда
			Продолжить;
		КонецЕсли; 		
		
		Чтение  								= Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(СтрокаТаблицы.ОписаниеПрибора);
		Описание								= ПрочитатьJSON(Чтение);
		
		Если Описание.Свойство("ТипПрибораУчета") Тогда
			Ключ								= Описание.ТипПрибораУчета;
			ТипПрибораУчета						= Справочники.энргТипыПриборовУчета.ПолучитьСсылку(Новый УникальныйИдентификатор(Ключ));
		КонецЕсли;
		
		Если Описание.Свойство("ВидКанальности") Тогда
			Ключ								= Описание.ВидКанальности;
			ВидКанальности						= Справочники.энргВидыКанальности.ПолучитьСсылку(Новый УникальныйИдентификатор(Ключ));
		КонецЕсли;
		
		Если Описание.Свойство("Код") Тогда
			Код									= Описание.Код;
		КонецЕсли;
		
		Если Описание.Свойство("РегистрируетОбъем") Тогда
			РегистрируетОбъем					= Описание.РегистрируетОбъем;
		КонецЕсли;
		
		Если Описание.Свойство("Фаза") Тогда
			Фаза								= Описание.Фаза;
		КонецЕсли;
		
		Если ОписаниеПриборов.НайтиСтроки(Новый Структура("ТипПрибораУчета, Код",ТипПрибораУчета,Код)).Количество() > 0 Тогда
			Отказ 								= Истина;
			Шаблон  							= НСтр("ru='Обнаружены строки с одниковым прибором учета - заводской номер: %1 и тип прибора учета: %2'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,Код, ТипПрибораУчета));
			Продолжить;
		КонецЕсли;
		
		СтрокаОписания  						= ОписаниеПриборов.Добавить();
		СтрокаОписания.Индекс 					= Индекс;
		СтрокаОписания.НомерСтроки 				= СтрокаТаблицы.НомерСтроки;
		СтрокаОписания.ТипПрибораУчета 			= ТипПрибораУчета;
		СтрокаОписания.Код 						= Код;
		СтрокаОписания.ВидКанальности 			= ВидКанальности;
		СтрокаОписания.РегистрируетОбъем 		= РегистрируетОбъем;
		СтрокаОписания.Фаза 					= Фаза;
		
		Индекс 									= Индекс + 1;
		
		Если НЕ ЗначениеЗаполнено(СтрокаОписания.Код)
			ИЛИ НЕ ЗначениеЗаполнено(СтрокаОписания.ТипПрибораУчета)
			ИЛИ НЕ ЗначениеЗаполнено(СтрокаОписания.ВидКанальности) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполнены не все ключевые параметры прибора учета, проведение не возможно");
			Отказ 								= Истина;	
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
	Текст 										=
	"ВЫБРАТЬ
	|	ТекущиеДанные.РегистрируетОбъем КАК РегистрируетОбъем,
	|	ТекущиеДанные.Индекс КАК Индекс,
	|	ТекущиеДанные.НомерСтроки КАК НомерСтроки,
	|	ТекущиеДанные.Код КАК Код,
	|	ТекущиеДанные.ТипПрибораУчета КАК ТипПрибораУчета,
	|	ТекущиеДанные.Фаза КАК Фаза,
	|	ВЫБОР
	|		КОГДА ТекущиеДанные.ВидКанальности = ЗНАЧЕНИЕ(Справочник.энргВидыКанальности.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргВидыКанальности.Одноканальный)
	|		ИНАЧЕ ТекущиеДанные.ВидКанальности
	|	КОНЕЦ КАК ВидКанальности
	|ПОМЕСТИТЬ ДанныеТЧ
	|ИЗ
	|	&ТекущиеДанные КАК ТекущиеДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Индекс КАК Индекс,
	|	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки,
	|	ВложенныйЗапрос.ПриборУчетаСсылка КАК ПриборУчетаСсылка,
	|	энргПриборыУчетаАбонента.ВидКанальности КАК ВидКанальности,
	|	энргПриборыУчетаАбонента.РегистрируетОбъем КАК РегистрируетОбъем,
	|	энргПриборыУчетаАбонента.Фаза КАК Фаза
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеТЧ.Индекс КАК Индекс,
	|		ДанныеТЧ.НомерСтроки КАК НомерСтроки,
	|		МИНИМУМ(энргПриборыУчетаАбонента.Ссылка) КАК ПриборУчетаСсылка
	|	ИЗ
	|		ДанныеТЧ КАК ДанныеТЧ
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|			ПО ДанныеТЧ.Код = энргПриборыУчетаАбонента.Код
	|				И ДанныеТЧ.ТипПрибораУчета = энргПриборыУчетаАбонента.ТипПрибораУчета
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДанныеТЧ.Индекс,
	|		ДанныеТЧ.НомерСтроки) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО ВложенныйЗапрос.ПриборУчетаСсылка = энргПриборыУчетаАбонента.Ссылка";
	
	Запрос  									= Новый Запрос(Текст);
	Запрос.УстановитьПараметр("ТекущиеДанные",ОписаниеПриборов);
	Результат  									= Запрос.Выполнить();
	Выборка  									= Результат.Выбрать();
	
	Пока Выборка.Следующий() цикл		
		СтрокаОписания 							= ОписаниеПриборов[Выборка.Индекс];
		СтрокаТабЧасти 							= ДанныеТабличнойЧасти[Выборка.НомерСтроки - 1];		
		Обновлять 								= НЕ СтрокаОписания.ВидКанальности = Выборка.ВидКанальности или НЕ СтрокаОписания.РегистрируетОбъем = Выборка.РегистрируетОбъем или НЕ СтрокаОписания.Фаза = Выборка.Фаза;		
		СтрокаТабЧасти.ПриборУчета 				= Выборка.ПриборУчетаСсылка;
		Если Обновлять Тогда
			ПриборОбъект 						= Выборка.ПриборУчетаСсылка.ПолучитьОбъект();
			ПриборОбъект.ВидКанальности 		= СтрокаОписания.ВидКанальности;
			ПриборОбъект.РегистрируетОбъем 		= СтрокаОписания.РегистрируетОбъем;
			ПриборОбъект.Фаза 					= СтрокаОписания.Фаза;
			ПриборОбъект.Записать();
		КонецЕсли;		
	КонецЦикла; 
	
КонецПроцедуры

Функция ЗначенияРеквизитовОбъектов(мПриборыУчета,ПолучаемыеСвойства) Экспорт
	РазрешенныеСвойства = ОпределитьРазрешенныеСвойства(ПолучаемыеСвойства);
	
	Результат 			= ОбщегоНазначения.ЗначенияРеквизитовОбъектов(мПриборыУчета, РазрешенныеСвойства);
	ДополнитьПолучаемыеСвойства(мПриборыУчета, ПолучаемыеСвойства, Результат); 
	
	Возврат Результат;		
КонецФункции

Функция УдалосьЗаполнитьОбъектПоОписанию(ПриборУчетаСсылка, ОписаниеОбъекта, ЭтоНоваяСсылка) Экспорт 
	
	ЕстьИзменения 									= Ложь;
	Если ЭтоНоваяСсылка Тогда
		ЭлементОбъект 								= СоздатьЭлемент();		
		ЭлементОбъект.УстановитьСсылкуНового(ПриборУчетаСсылка);
		ЕстьИзменения 								= Истина;
	Иначе
		ЭлементОбъект 								= ПриборУчетаСсылка.ПолучитьОбъект();
	КонецЕсли;	
	
	ЗаполнитьОбъектПоОписанию(ЭлементОбъект, ОписаниеОбъекта, ЕстьИзменения);

	Если Не ЕстьИзменения Тогда
		Возврат Истина;
	КонецЕсли;
	
	Попытка
		ПопыткаЗаписиОбъекта(ЭлементОбъект, ОписаниеОбъекта); 		
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Процедура ЗаполнитьОбъектПоОписанию(ЭлементОбъект, ОписаниеОбъекта, ЕстьИзменения) Экспорт 
	
	Если НЕ ЭлементОбъект.Код = ОписаниеОбъекта.Код Тогда 
		ЭлементОбъект.Код 							= ОписаниеОбъекта.Код;
		ЕстьИзменения								= Истина;
	КонецЕсли;
	
	Если НЕ ЭлементОбъект.РегистрируетОбъем = ОписаниеОбъекта.РегистрируетОбъем Тогда 
		ЭлементОбъект.РегистрируетОбъем 			= ОписаниеОбъекта.РегистрируетОбъем;
		ЕстьИзменения								= Истина;
	КонецЕсли;
	
	Если НЕ ЭлементОбъект.ТипПрибораУчета = ОписаниеОбъекта.ТипПрибораУчета Тогда 
		ЭлементОбъект.ТипПрибораУчета 				= ОписаниеОбъекта.ТипПрибораУчета;
		ЕстьИзменения								= Истина;
	КонецЕсли;
	
	Если НЕ ЭлементОбъект.ТипУзлаУчета = ОписаниеОбъекта.ТипУзлаУчета Тогда 
		ЭлементОбъект.ТипУзлаУчета 					= ОписаниеОбъекта.ТипУзлаУчета;
		ЕстьИзменения								= Истина;
	КонецЕсли;
	
	Если НЕ ЭлементОбъект.ВидКанальности = ОписаниеОбъекта.ВидКанальности Тогда 
		ЭлементОбъект.ВидКанальности 				= ОписаниеОбъекта.ВидКанальности;
		ЕстьИзменения								= Истина;
	КонецЕсли;
	
	Если НЕ ЭлементОбъект.КодАСКУЭ = ОписаниеОбъекта.КодАСКУЭ Тогда 
		ЭлементОбъект.КодАСКУЭ 						= ОписаниеОбъекта.КодАСКУЭ;
		ЕстьИзменения								= Истина;
	КонецЕсли;
	
	Если НЕ ЭлементОбъект.СобственникАСКУЭ = ОписаниеОбъекта.СобственникАСКУЭ Тогда 
		ЭлементОбъект.СобственникАСКУЭ 				= ОписаниеОбъекта.СобственникАСКУЭ;
		ЕстьИзменения								= Истина;
	КонецЕсли;
	
	Если НЕ ЭлементОбъект.СистемаУчетаЭлектроэнергии = ОписаниеОбъекта.СистемаУчетаЭлектроэнергии Тогда 
		ЭлементОбъект.СистемаУчетаЭлектроэнергии	= ОписаниеОбъекта.СистемаУчетаЭлектроэнергии;
		ЕстьИзменения								= Истина;
	КонецЕсли;
	
	Если НЕ ЭлементОбъект.ДатаИнтеграцииССистемой = ОписаниеОбъекта.ДатаИнтеграцииССистемой Тогда 
		ЭлементОбъект.ДатаИнтеграцииССистемой		= ОписаниеОбъекта.ДатаИнтеграцииССистемой;
		ЕстьИзменения								= Истина;
	КонецЕсли;
	
	Если НЕ ЭлементОбъект.СобственникСИ = ОписаниеОбъекта.СобственникСИ Тогда 
		ЭлементОбъект.СобственникСИ					= ОписаниеОбъекта.СобственникСИ;
		ЕстьИзменения								= Истина;
	КонецЕсли;
	
	Если НЕ ЭлементОбъект.РасположениеИзмерителя = ОписаниеОбъекта.РасположениеИзмерителя Тогда 
		ЭлементОбъект.РасположениеИзмерителя		= ОписаниеОбъекта.РасположениеИзмерителя;
		ЕстьИзменения								= Истина;
	КонецЕсли;
	
	Если НЕ ЭлементОбъект.ДатаВыпуска = ОписаниеОбъекта.ДатаВыпуска Тогда 
		ЭлементОбъект.ДатаВыпуска					= ОписаниеОбъекта.ДатаВыпуска;
		ЕстьИзменения								= Истина;
	КонецЕсли;
	
	Если НЕ ЭлементОбъект.Фаза = ОписаниеОбъекта.Фаза Тогда 
		ЭлементОбъект.Фаза							= ОписаниеОбъекта.Фаза;
		ЕстьИзменения								= Истина;
	КонецЕсли;
	
	Если НЕ ЭлементОбъект.БалансоваяПринадлежность = ОписаниеОбъекта.БалансоваяПринадлежность Тогда 
		ЭлементОбъект.БалансоваяПринадлежность		= ОписаниеОбъекта.БалансоваяПринадлежность;
		ЕстьИзменения								= Истина;
	КонецЕсли;
	
	Если НЕ ЭлементОбъект.ДатаУстановки = ОписаниеОбъекта.ДатаУстановки Тогда 
		ЭлементОбъект.ДатаУстановки					= ОписаниеОбъекта.ДатаУстановки;
		ЕстьИзменения								= Истина;
	КонецЕсли;
КонецПроцедуры

#Область ПерезаписатьМаксимальноВозможныеПоказания

Процедура НачатьПерезаписатьМаксимальноВозможныеПоказания() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргПриборыУчетаАбонента.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
		|ГДЕ
		|	НЕ энргПриборыУчетаАбонента.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	КоличествоПотоков = 10;
	ОбщееКоличество = Выборка.Количество(); 	
	Если ОбщееКоличество <= КоличествоПотоков Тогда 
		Порция = ОбщееКоличество;
	Иначе 
		Порция = Цел(ОбщееКоличество / КоличествоПотоков);
		Если (ОбщееКоличество % КоличествоПотоков) > 0 Тогда			
			Порция = Порция + 1;
		КонецЕсли;
	КонецЕсли;	
	
	Итерация = 0;
	ПодготовленныеПотоки = Новый Массив;
	Для Сч = 1 По КоличествоПотоков Цикл		
		ПодготовленныеПотоки.Добавить(Новый Массив);		
	КонецЦикла;
	
	Пока Выборка.Следующий() Цикл
		
		Если Итерация > КоличествоПотоков - 1 Тогда
			Итерация = 0;
		КонецЕсли;
		
		ПодготовленныеПотоки[Итерация].Добавить(Выборка.Ссылка);
		
		Итерация = Итерация + 1;
		
	КонецЦикла;
	
	Для Каждого Поток из ПодготовленныеПотоки Цикл 
		ЗапуститьФоновоеЗаданиеПерезаписиМаксимальноВозможныхПоказаний(Поток);	
	КонецЦикла;	
	
КонецПроцедуры

// Процедура - Перезаписать максимально возможные показания
// 		Обновление реквизита "МаксимальноВозможныеПоказания" происходит в модуле объекта
//
// Параметры:
//  ПриборыУчета - Массив - Список приборов учета
//
Процедура ПерезаписатьМаксимальноВозможныеПоказания(ПриборыУчета) Экспорт 
	
	Событие = НСтр("ru = 'Перезапись максимально возможных показаний приборов учета'");
	ВсегоСтрок = ПриборыУчета.Количество();
	СчетчикОбщий = 0;
	Итерация = 0;
	Порция = 100;
	
	Для Каждого ТекущийПрибор из ПриборыУчета Цикл 
		
		Если Итерация = Порция Тогда
			
			Итерация = 0;			
			ЗаписьЖурналаРегистрации(
				Событие,
				УровеньЖурналаРегистрации.Информация,,,
				"Обработано " + СчетчикОбщий + " из " + ВсегоСтрок);
				
		КонецЕсли;
		
		ОбъектПрибор = ТекущийПрибор.ПолучитьОбъект();
		Попытка
		
			ОбъектПрибор.Записать();
		
		Исключение
			
			Инфо = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации(
				Событие,
				УровеньЖурналаРегистрации.Ошибка,, 
				ТекущийПрибор,
				"Ошибка " + ТекущийПрибор + " причина: " + ПодробноеПредставлениеОшибки(Инфо));
				
			ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(Инфо));
		
		КонецПопытки;
		
		СчетчикОбщий = СчетчикОбщий + 1;
		Итерация = Итерация + 1;
		
	КонецЦикла;	
	
КонецПроцедуры
	
#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	Перем Период, Район,Организация,КлючПомещения,ТочкаУчета;
	
	Если Параметры.Свойство("Период") Тогда
		Период 				= Параметры.Период;
	КонецЕсли;
	
	Если Параметры.Свойство("Район") Тогда
		Район 				= Параметры.Район;
	КонецЕсли;
	
	Если Параметры.Свойство("Организация") Тогда
		Организация 		= Параметры.Организация;
	КонецЕсли;
	
	Если Параметры.Свойство("КлючПомещения") Тогда
		КлючПомещения 		= Параметры.КлючПомещения;
	КонецЕсли;
	
	Если Параметры.Свойство("ТочкаУчета") Тогда
		ТочкаУчета 			= Параметры.ТочкаУчета;
	КонецЕсли;
	
	Если НЕ Район = Неопределено 
		И НЕ Организация = Неопределено
		И НЕ КлючПомещения = Неопределено
		И НЕ КлючПомещения = Неопределено
		И НЕ ТочкаУчета = Неопределено Тогда
		СтандартнаяОбработка 	= Ложь;
		мПриборыУчета			= энргСостояниеПриборовУчета.ДействующиеПриборыУчетаПомещения(Период,Организация, Район, КлючПомещения, ТочкаУчета).Выгрузить().ВыгрузитьКолонку("ПриборУчета");
		
		ДанныеВыбора			= Новый СписокЗначений;
		ДанныеВыбора.ЗагрузитьЗначения(мПриборыУчета);		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОпределитьРазрешенныеСвойства(ПолучаемыеСвойства)
	Возврат ПолучаемыеСвойства;
КонецФункции

Процедура ДополнитьПолучаемыеСвойства(мПриборыУчета, ПолучаемыеСвойства, Результат)
	
КонецПроцедуры	

Процедура ПопыткаЗаписиОбъекта(ЭлементОбъект, ОписаниеОбъекта) 
	ЭлементОбъект.Записать();
КонецПроцедуры

Процедура ЗапуститьФоновоеЗаданиеПерезаписиМаксимальноВозможныхПоказаний(Поток)
	
	ИмяФункции = "Справочники.энргПриборыУчетаАбонента.ПерезаписатьМаксимальноВозможныеПоказания";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Перезапись максимально возможных показаний приборов учета'");
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения, 
		ИмяФункции,
		Поток);
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
